benchmarking/heroku-read_heavy.txt
hey -c 1 -z 10s -m POST https://lorem-news-744a01eedf0b.herokuapp.com/benchmarking/read_heavyfractaled@Stephens-MBP rubyconftw % hey -c 1 -z 10s -m POST https://lorem-news-744a01eedf0b.herokuapp.com/benchmarking/read_heavy

Summary:
  Total:	10.0414 secs
  Slowest:	0.6925 secs
  Fastest:	0.0508 secs
  Average:	0.0913 secs
  Requests/sec:	10.9547

  Total data:	1109516 bytes
  Size/request:	10086 bytes

Response time histogram:
  0.051 [1]	|■
  0.115 [74]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.179 [33]	|■■■■■■■■■■■■■■■■■■
  0.243 [1]	|■
  0.307 [0]	|
  0.372 [0]	|
  0.436 [0]	|
  0.500 [0]	|
  0.564 [0]	|
  0.628 [0]	|
  0.692 [1]	|■


Latency distribution:
  10% in 0.0527 secs
  25% in 0.0543 secs
  50% in 0.0661 secs
  75% in 0.1324 secs
  90% in 0.1445 secs
  95% in 0.1578 secs
  99% in 0.6925 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0065 secs, 0.0508 secs, 0.6925 secs
  DNS-lookup:	0.0045 secs, 0.0000 secs, 0.4880 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0830 secs, 0.0505 secs, 0.1560 secs
  resp read:	0.0017 secs, 0.0000 secs, 0.0336 secs

Status code distribution:
  [200]	79 responses
  [201]	28 responses
  [204]	3 responses



fractaled@Stephens-MBP rubyconftw % hey -c 2 -z 10s -m POST https://lorem-news-744a01eedf0b.herokuapp.com/benchmarking/read_heavy

Summary:
  Total:	10.0397 secs
  Slowest:	0.2280 secs
  Fastest:	0.0496 secs
  Average:	0.0850 secs
  Requests/sec:	23.5068

  Total data:	2351672 bytes
  Size/request:	9964 bytes

Response time histogram:
  0.050 [1]	|
  0.067 [139]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.085 [26]	|■■■■■■■
  0.103 [1]	|
  0.121 [3]	|■
  0.139 [25]	|■■■■■■■
  0.157 [29]	|■■■■■■■■
  0.174 [8]	|■■
  0.192 [1]	|
  0.210 [0]	|
  0.228 [3]	|■


Latency distribution:
  10% in 0.0523 secs
  25% in 0.0544 secs
  50% in 0.0631 secs
  75% in 0.1337 secs
  90% in 0.1465 secs
  95% in 0.1621 secs
  99% in 0.2147 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0013 secs, 0.0496 secs, 0.2280 secs
  DNS-lookup:	0.0004 secs, 0.0000 secs, 0.0415 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0811 secs, 0.0495 secs, 0.1774 secs
  resp read:	0.0015 secs, 0.0000 secs, 0.0316 secs

Status code distribution:
  [200]	175 responses
  [201]	46 responses
  [204]	15 responses



fractaled@Stephens-MBP rubyconftw % hey -c 4 -z 10s -m POST https://lorem-news-744a01eedf0b.herokuapp.com/benchmarking/read_heavy

Summary:
  Total:	10.1159 secs
  Slowest:	0.2526 secs
  Fastest:	0.0464 secs
  Average:	0.0838 secs
  Requests/sec:	47.4501

  Total data:	4386802 bytes
  Size/request:	9139 bytes

Response time histogram:
  0.046 [1]	|
  0.067 [273]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.088 [80]	|■■■■■■■■■■■■
  0.108 [6]	|■
  0.129 [6]	|■
  0.149 [59]	|■■■■■■■■■
  0.170 [36]	|■■■■■
  0.191 [12]	|■■
  0.211 [4]	|■
  0.232 [2]	|
  0.253 [1]	|


Latency distribution:
  10% in 0.0521 secs
  25% in 0.0544 secs
  50% in 0.0638 secs
  75% in 0.1098 secs
  90% in 0.1508 secs
  95% in 0.1643 secs
  99% in 0.2095 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0013 secs, 0.0464 secs, 0.2526 secs
  DNS-lookup:	0.0003 secs, 0.0000 secs, 0.0326 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0804 secs, 0.0463 secs, 0.1903 secs
  resp read:	0.0013 secs, 0.0000 secs, 0.0376 secs

Status code distribution:
  [200]	357 responses
  [201]	93 responses
  [204]	30 responses



fractaled@Stephens-MBP rubyconftw % hey -c 8 -z 10s -m POST https://lorem-news-744a01eedf0b.herokuapp.com/benchmarking/read_heavy

Summary:
  Total:	10.9422 secs
  Slowest:	1.2182 secs
  Fastest:	0.0486 secs
  Average:	0.1015 secs
  Requests/sec:	75.0308

  Total data:	7348806 bytes
  Size/request:	8951 bytes

Response time histogram:
  0.049 [1]	|
  0.166 [689]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.282 [120]	|■■■■■■■
  0.399 [4]	|
  0.516 [0]	|
  0.633 [1]	|
  0.750 [5]	|
  0.867 [0]	|
  0.984 [0]	|
  1.101 [0]	|
  1.218 [1]	|


Latency distribution:
  10% in 0.0544 secs
  25% in 0.0588 secs
  50% in 0.0701 secs
  75% in 0.1387 secs
  90% in 0.1815 secs
  95% in 0.2187 secs
  99% in 0.3834 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0014 secs, 0.0486 secs, 1.2182 secs
  DNS-lookup:	0.0004 secs, 0.0000 secs, 0.0370 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0986 secs, 0.0485 secs, 1.2181 secs
  resp read:	0.0011 secs, 0.0000 secs, 0.0361 secs

Status code distribution:
  [200]	622 responses
  [201]	166 responses
  [204]	33 responses



fractaled@Stephens-MBP rubyconftw % hey -c 16 -z 10s -m POST https://lorem-news-744a01eedf0b.herokuapp.com/benchmarking/read_heavy

Summary:
  Total:	10.2490 secs
  Slowest:	0.4560 secs
  Fastest:	0.0491 secs
  Average:	0.1243 secs
  Requests/sec:	127.2317

  Total data:	11825891 bytes
  Size/request:	9068 bytes

Response time histogram:
  0.049 [1]	|
  0.090 [747]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.131 [187]	|■■■■■■■■■■
  0.171 [55]	|■■■
  0.212 [73]	|■■■■
  0.253 [90]	|■■■■■
  0.293 [69]	|■■■■
  0.334 [36]	|■■
  0.375 [29]	|■■
  0.415 [11]	|■
  0.456 [6]	|


Latency distribution:
  10% in 0.0596 secs
  25% in 0.0680 secs
  50% in 0.0820 secs
  75% in 0.1635 secs
  90% in 0.2660 secs
  95% in 0.3126 secs
  99% in 0.3883 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0018 secs, 0.0491 secs, 0.4560 secs
  DNS-lookup:	0.0004 secs, 0.0000 secs, 0.0365 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0004 secs
  resp wait:	0.1204 secs, 0.0491 secs, 0.4292 secs
  resp read:	0.0020 secs, 0.0000 secs, 0.0409 secs

Status code distribution:
  [200]	972 responses
  [201]	280 responses
  [204]	52 responses



fractaled@Stephens-MBP rubyconftw % hey -c 32 -z 10s -m POST https://lorem-news-744a01eedf0b.herokuapp.com/benchmarking/read_heavy

Summary:
  Total:	10.4030 secs
  Slowest:	1.7884 secs
  Fastest:	0.0775 secs
  Average:	0.3046 secs
  Requests/sec:	102.9515

  Total data:	9863616 bytes
  Size/request:	9209 bytes

Response time histogram:
  0.077 [1]	|
  0.249 [722]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.420 [65]	|■■■■
  0.591 [190]	|■■■■■■■■■■■
  0.762 [56]	|■■■
  0.933 [4]	|
  1.104 [1]	|
  1.275 [0]	|
  1.446 [17]	|■
  1.617 [11]	|■
  1.788 [4]	|


Latency distribution:
  10% in 0.1283 secs
  25% in 0.1512 secs
  50% in 0.1919 secs
  75% in 0.4438 secs
  90% in 0.5781 secs
  95% in 0.6714 secs
  99% in 1.5224 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0345 secs, 0.0775 secs, 1.7884 secs
  DNS-lookup:	0.0009 secs, 0.0000 secs, 0.0293 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0006 secs
  resp wait:	0.2633 secs, 0.0670 secs, 0.9943 secs
  resp read:	0.0025 secs, 0.0000 secs, 0.0374 secs

Status code distribution:
  [200]	798 responses
  [201]	216 responses
  [204]	57 responses



fractaled@Stephens-MBP rubyconftw % hey -c 64 -z 10s -m POST https://lorem-news-744a01eedf0b.herokuapp.com/benchmarking/read_heavy

Summary:
  Total:	10.5150 secs
  Slowest:	0.9171 secs
  Fastest:	0.2134 secs
  Average:	0.4567 secs
  Requests/sec:	136.2814

  Total data:	12630748 bytes
  Size/request:	8814 bytes

Response time histogram:
  0.213 [1]	|
  0.284 [75]	|■■■■■■■■
  0.354 [343]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.424 [376]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.495 [245]	|■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.565 [60]	|■■■■■■
  0.636 [66]	|■■■■■■■
  0.706 [106]	|■■■■■■■■■■■
  0.776 [92]	|■■■■■■■■■■
  0.847 [60]	|■■■■■■
  0.917 [9]	|■


Latency distribution:
  10% in 0.3036 secs
  25% in 0.3445 secs
  50% in 0.4091 secs
  75% in 0.5269 secs
  90% in 0.7208 secs
  95% in 0.7742 secs
  99% in 0.8340 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0071 secs, 0.2134 secs, 0.9171 secs
  DNS-lookup:	0.0012 secs, 0.0000 secs, 0.0273 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0003 secs
  resp wait:	0.4481 secs, 0.0604 secs, 0.8758 secs
  resp read:	0.0014 secs, 0.0000 secs, 0.0530 secs

Status code distribution:
  [200]	1080 responses
  [201]	305 responses
  [204]	48 responses



fractaled@Stephens-MBP rubyconftw % hey -c 128 -z 10s -m POST https://lorem-news-744a01eedf0b.herokuapp.com/benchmarking/read_heavy

Summary:
  Total:	10.8445 secs
  Slowest:	2.0057 secs
  Fastest:	0.2241 secs
  Average:	0.9413 secs
  Requests/sec:	130.0200

  Total data:	12204899 bytes
  Size/request:	8655 bytes

Response time histogram:
  0.224 [1]	|
  0.402 [24]	|■■
  0.580 [25]	|■■
  0.759 [258]	|■■■■■■■■■■■■■■■■■■■■■■
  0.937 [474]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.115 [299]	|■■■■■■■■■■■■■■■■■■■■■■■■■
  1.293 [207]	|■■■■■■■■■■■■■■■■■
  1.471 [76]	|■■■■■■
  1.649 [33]	|■■■
  1.828 [6]	|■
  2.006 [7]	|■


Latency distribution:
  10% in 0.6784 secs
  25% in 0.7783 secs
  50% in 0.8885 secs
  75% in 1.1049 secs
  90% in 1.2643 secs
  95% in 1.4057 secs
  99% in 1.5988 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0157 secs, 0.2241 secs, 2.0057 secs
  DNS-lookup:	0.0029 secs, 0.0000 secs, 0.0325 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.9240 secs, 0.0599 secs, 2.0019 secs
  resp read:	0.0015 secs, 0.0000 secs, 0.0613 secs

Status code distribution:
  [200]	1061 responses
  [201]	276 responses
  [204]	73 responses



fractaled@Stephens-MBP rubyconftw % hey -c 256 -z 10s -m POST https://lorem-news-744a01eedf0b.herokuapp.com/benchmarking/read_heavy

Summary:
  Total:	11.9872 secs
  Slowest:	2.8816 secs
  Fastest:	0.2936 secs
  Average:	1.5758 secs
  Requests/sec:	147.5737

  Total data:	15675215 bytes
  Size/request:	8861 bytes

Response time histogram:
  0.294 [1]	|
  0.552 [45]	|■■
  0.811 [31]	|■■
  1.070 [36]	|■■
  1.329 [50]	|■■■
  1.588 [622]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.846 [750]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.105 [229]	|■■■■■■■■■■■■
  2.364 [4]	|
  2.623 [0]	|
  2.882 [1]	|


Latency distribution:
  10% in 1.3431 secs
  25% in 1.4920 secs
  50% in 1.6118 secs
  75% in 1.7430 secs
  90% in 1.8969 secs
  95% in 1.9585 secs
  99% in 2.0647 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0262 secs, 0.2936 secs, 2.8816 secs
  DNS-lookup:	0.0047 secs, 0.0000 secs, 0.0370 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0029 secs
  resp wait:	1.5383 secs, 0.1252 secs, 2.6563 secs
  resp read:	0.0015 secs, 0.0000 secs, 0.0374 secs

Status code distribution:
  [200]	1338 responses
  [201]	344 responses
  [204]	87 responses



fractaled@Stephens-MBP rubyconftw % hey -c 256 -z 10s -m POST https://lorem-news-744a01eedf0b.herokuapp.com/benchmarking/read_heavy

Summary:
  Total:	11.7570 secs
  Slowest:	2.1985 secs
  Fastest:	0.2187 secs
  Average:	1.6188 secs
  Requests/sec:	145.1904

  Total data:	15032153 bytes
  Size/request:	8806 bytes

Response time histogram:
  0.219 [1]	|
  0.417 [35]	|■■
  0.615 [24]	|■
  0.813 [32]	|■■
  1.011 [26]	|■
  1.209 [37]	|■■
  1.407 [32]	|■■
  1.605 [301]	|■■■■■■■■■■■■■■
  1.803 [845]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.001 [272]	|■■■■■■■■■■■■■
  2.199 [102]	|■■■■■


Latency distribution:
  10% in 1.3119 secs
  25% in 1.5879 secs
  50% in 1.6685 secs
  75% in 1.7776 secs
  90% in 1.9558 secs
  95% in 2.0194 secs
  99% in 2.1131 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0288 secs, 0.2187 secs, 2.1985 secs
  DNS-lookup:	0.0067 secs, 0.0000 secs, 0.0512 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	1.5875 secs, 0.0599 secs, 2.1937 secs
  resp read:	0.0015 secs, 0.0000 secs, 0.0591 secs

Status code distribution:
  [200]	1269 responses
  [201]	359 responses
  [204]	79 responses



fractaled@Stephens-MBP rubyconftw % hey -c 128 -z 10s -m POST https://lorem-news-744a01eedf0b.herokuapp.com/benchmarking/read_heavy

Summary:
  Total:	10.7137 secs
  Slowest:	1.4429 secs
  Fastest:	0.1959 secs
  Average:	0.8738 secs
  Requests/sec:	140.8472

  Total data:	13302829 bytes
  Size/request:	8815 bytes

Response time histogram:
  0.196 [1]	|
  0.321 [22]	|■■
  0.445 [17]	|■
  0.570 [24]	|■■
  0.695 [110]	|■■■■■■■■■
  0.819 [480]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.944 [406]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.069 [175]	|■■■■■■■■■■■■■■■
  1.194 [162]	|■■■■■■■■■■■■■■
  1.318 [96]	|■■■■■■■■
  1.443 [16]	|■


Latency distribution:
  10% in 0.6791 secs
  25% in 0.7604 secs
  50% in 0.8425 secs
  75% in 1.0001 secs
  90% in 1.1599 secs
  95% in 1.2251 secs
  99% in 1.3225 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0148 secs, 0.1959 secs, 1.4429 secs
  DNS-lookup:	0.0027 secs, 0.0000 secs, 0.0332 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0023 secs
  resp wait:	0.8575 secs, 0.0578 secs, 1.4133 secs
  resp read:	0.0013 secs, 0.0000 secs, 0.0470 secs

Status code distribution:
  [200]	1106 responses
  [201]	334 responses
  [204]	69 responses



fractaled@Stephens-MBP rubyconftw % hey -c 64 -z 10s -m POST https://lorem-news-744a01eedf0b.herokuapp.com/benchmarking/read_heavy

Summary:
  Total:	10.5382 secs
  Slowest:	0.8994 secs
  Fastest:	0.2147 secs
  Average:	0.4299 secs
  Requests/sec:	144.9959

  Total data:	13512164 bytes
  Size/request:	8843 bytes

Response time histogram:
  0.215 [1]	|
  0.283 [107]	|■■■■■■■■
  0.352 [517]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.420 [338]	|■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.489 [161]	|■■■■■■■■■■■■
  0.557 [70]	|■■■■■
  0.625 [104]	|■■■■■■■■
  0.694 [109]	|■■■■■■■■
  0.762 [84]	|■■■■■■
  0.831 [25]	|■■
  0.899 [12]	|■


Latency distribution:
  10% in 0.2900 secs
  25% in 0.3235 secs
  50% in 0.3771 secs
  75% in 0.5056 secs
  90% in 0.6691 secs
  95% in 0.7303 secs
  99% in 0.8256 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0077 secs, 0.2147 secs, 0.8994 secs
  DNS-lookup:	0.0015 secs, 0.0000 secs, 0.0372 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0006 secs
  resp wait:	0.4204 secs, 0.0629 secs, 0.8987 secs
  resp read:	0.0015 secs, 0.0000 secs, 0.0388 secs

Status code distribution:
  [200]	1161 responses
  [201]	294 responses
  [204]	73 responses



fractaled@Stephens-MBP rubyconftw % hey -c 32 -z 10s -m POST https://lorem-news-744a01eedf0b.herokuapp.com/benchmarking/read_heavy

Summary:
  Total:	10.5636 secs
  Slowest:	2.9689 secs
  Fastest:	0.0648 secs
  Average:	0.2189 secs
  Requests/sec:	140.5770

  Total data:	12362791 bytes
  Size/request:	8325 bytes

Response time histogram:
  0.065 [1]	|
  0.355 [1178]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.646 [292]	|■■■■■■■■■■
  0.936 [4]	|
  1.226 [1]	|
  1.517 [0]	|
  1.807 [1]	|
  2.098 [1]	|
  2.388 [1]	|
  2.679 [1]	|
  2.969 [5]	|


Latency distribution:
  10% in 0.0977 secs
  25% in 0.1150 secs
  50% in 0.1435 secs
  75% in 0.2860 secs
  90% in 0.4275 secs
  95% in 0.4799 secs
  99% in 0.6881 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0041 secs, 0.0648 secs, 2.9689 secs
  DNS-lookup:	0.0012 secs, 0.0000 secs, 0.0568 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.2097 secs, 0.0564 secs, 2.9687 secs
  resp read:	0.0051 secs, 0.0000 secs, 0.8408 secs

Status code distribution:
  [200]	1104 responses
  [201]	300 responses
  [204]	81 responses



fractaled@Stephens-MBP rubyconftw % hey -c 16 -z 10s -m POST https://lorem-news-744a01eedf0b.herokuapp.com/benchmarking/read_heavy

Summary:
  Total:	10.1840 secs
  Slowest:	0.5500 secs
  Fastest:	0.0487 secs
  Average:	0.1238 secs
  Requests/sec:	128.2399

  Total data:	11449049 bytes
  Size/request:	8766 bytes

Response time histogram:
  0.049 [1]	|
  0.099 [854]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.149 [113]	|■■■■■
  0.199 [75]	|■■■■
  0.249 [111]	|■■■■■
  0.299 [64]	|■■■
  0.350 [48]	|■■
  0.400 [24]	|■
  0.450 [10]	|
  0.500 [1]	|
  0.550 [5]	|


Latency distribution:
  10% in 0.0601 secs
  25% in 0.0677 secs
  50% in 0.0814 secs
  75% in 0.1645 secs
  90% in 0.2638 secs
  95% in 0.3218 secs
  99% in 0.4126 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0019 secs, 0.0487 secs, 0.5500 secs
  DNS-lookup:	0.0004 secs, 0.0000 secs, 0.0323 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.1201 secs, 0.0486 secs, 0.5425 secs
  resp read:	0.0018 secs, 0.0000 secs, 0.2153 secs

Status code distribution:
  [200]	974 responses
  [201]	274 responses
  [204]	58 responses



fractaled@Stephens-MBP rubyconftw % hey -c 8 -z 10s -m POST https://lorem-news-744a01eedf0b.herokuapp.com/benchmarking/read_heavy

Summary:
  Total:	10.1064 secs
  Slowest:	0.3294 secs
  Fastest:	0.0477 secs
  Average:	0.0869 secs
  Requests/sec:	91.4270

  Total data:	8014186 bytes
  Size/request:	8673 bytes

Response time histogram:
  0.048 [1]	|
  0.076 [639]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.104 [47]	|■■■
  0.132 [10]	|■
  0.160 [116]	|■■■■■■■
  0.189 [72]	|■■■■■
  0.217 [29]	|■■
  0.245 [9]	|■
  0.273 [0]	|
  0.301 [0]	|
  0.329 [1]	|


Latency distribution:
  10% in 0.0518 secs
  25% in 0.0542 secs
  50% in 0.0626 secs
  75% in 0.1203 secs
  90% in 0.1662 secs
  95% in 0.1834 secs
  99% in 0.2193 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0014 secs, 0.0477 secs, 0.3294 secs
  DNS-lookup:	0.0005 secs, 0.0000 secs, 0.0472 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0833 secs, 0.0476 secs, 0.2380 secs
  resp read:	0.0013 secs, 0.0000 secs, 0.0347 secs

Status code distribution:
  [200]	687 responses
  [201]	194 responses
  [204]	43 responses



fractaled@Stephens-MBP rubyconftw % hey -c 4 -z 10s -m POST https://lorem-news-744a01eedf0b.herokuapp.com/benchmarking/read_heavy

Summary:
  Total:	10.1056 secs
  Slowest:	1.2324 secs
  Fastest:	0.0469 secs
  Average:	0.0890 secs
  Requests/sec:	44.6285

  Total data:	3557696 bytes
  Size/request:	7888 bytes

Response time histogram:
  0.047 [1]	|
  0.165 [425]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.284 [16]	|■■
  0.403 [3]	|
  0.521 [2]	|
  0.640 [0]	|
  0.758 [1]	|
  0.877 [1]	|
  0.995 [0]	|
  1.114 [1]	|
  1.232 [1]	|


Latency distribution:
  10% in 0.0514 secs
  25% in 0.0533 secs
  50% in 0.0572 secs
  75% in 0.0981 secs
  90% in 0.1435 secs
  95% in 0.1668 secs
  99% in 0.6830 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0016 secs, 0.0469 secs, 1.2324 secs
  DNS-lookup:	0.0003 secs, 0.0000 secs, 0.0295 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0008 secs
  resp wait:	0.0855 secs, 0.0468 secs, 1.2323 secs
  resp read:	0.0013 secs, 0.0000 secs, 0.0310 secs

Status code distribution:
  [200]	328 responses
  [201]	101 responses
  [204]	22 responses



fractaled@Stephens-MBP rubyconftw % hey -c 2 -z 10s -m POST https://lorem-news-744a01eedf0b.herokuapp.com/benchmarking/read_heavy

Summary:
  Total:	10.1027 secs
  Slowest:	0.4554 secs
  Fastest:	0.0488 secs
  Average:	0.0988 secs
  Requests/sec:	20.1926

  Total data:	2115260 bytes
  Size/request:	10368 bytes

Response time histogram:
  0.049 [1]	|
  0.089 [122]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.130 [24]	|■■■■■■■■
  0.171 [44]	|■■■■■■■■■■■■■■
  0.211 [4]	|■
  0.252 [2]	|■
  0.293 [0]	|
  0.333 [1]	|
  0.374 [1]	|
  0.415 [3]	|■
  0.455 [2]	|■


Latency distribution:
  10% in 0.0519 secs
  25% in 0.0542 secs
  50% in 0.0656 secs
  75% in 0.1314 secs
  90% in 0.1494 secs
  95% in 0.2054 secs
  99% in 0.4183 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0041 secs, 0.0488 secs, 0.4554 secs
  DNS-lookup:	0.0004 secs, 0.0000 secs, 0.0354 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0038 secs
  resp wait:	0.0935 secs, 0.0487 secs, 0.4540 secs
  resp read:	0.0011 secs, 0.0000 secs, 0.0254 secs

Status code distribution:
  [200]	147 responses
  [201]	46 responses
  [204]	11 responses



fractaled@Stephens-MBP rubyconftw % hey -c 1 -z 10s -m POST https://lorem-news-744a01eedf0b.herokuapp.com/benchmarking/read_heavy

Summary:
  Total:	10.0153 secs
  Slowest:	0.2775 secs
  Fastest:	0.0490 secs
  Average:	0.0764 secs
  Requests/sec:	13.0800

  Total data:	1087443 bytes
  Size/request:	8301 bytes

Response time histogram:
  0.049 [1]	|
  0.072 [95]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.095 [4]	|■■
  0.118 [0]	|
  0.140 [22]	|■■■■■■■■■
  0.163 [7]	|■■■
  0.186 [0]	|
  0.209 [1]	|
  0.232 [0]	|
  0.255 [0]	|
  0.277 [1]	|


Latency distribution:
  10% in 0.0518 secs
  25% in 0.0524 secs
  50% in 0.0555 secs
  75% in 0.0806 secs
  90% in 0.1351 secs
  95% in 0.1541 secs
  99% in 0.2775 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0020 secs, 0.0490 secs, 0.2775 secs
  DNS-lookup:	0.0003 secs, 0.0000 secs, 0.0391 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0730 secs, 0.0489 secs, 0.1614 secs
  resp read:	0.0013 secs, 0.0000 secs, 0.0350 secs

Status code distribution:
  [200]	98 responses
  [201]	28 responses
  [204]	5 responses



fractaled@Stephens-MBP rubyconftw %